title: ViewState Deserialization Attack Detection
id: 6b9f0e8a-5c3d-4e91-8a2e-4293d6c4b10f
status: experimental
description: Detects ViewState deserialization attacks by monitoring for specific system commands and HTTP POST requests to the /sitecore/blocked.aspx endpoint, which are indicative of this type of attack.
author: Andrew Skatoff
date: 2025/09/03
tags:
  - attack.t1036
  - attack.t1057
  - attack.t1082
  - attack.t1049
  - attack.t1083
  - attack.t1027
  - attack.t1059
  - attack.t1140
  - attack.t1071
  - attack.t1087
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    EventID: 1
    CommandLine|contains: 
      - 'whoami'
      - 'hostname'
      - 'net user'
      - 'tasklist'
      - 'ipconfig /all'
      - 'tasklist /svc'
      - 'netstat -ano'
      - 'nslookup'
      - 'net group domain admins'
      - 'net localgroup administrators'
  selection2:
    EventID: 3
    DestinationPort: 80
    DestinationIp: 
      - '130.33.156.194'
      - '103.235.46.102'
    Initiated: true
  condition: selection1 and selection2
fields:
  - CommandLine
  - ParentCommandLine
  - DestinationPort
  - DestinationIp
falsepositives:
  - Legitimate administrative activities
  - Network scanning tools
level: high
