title: Suspicious Net Group Command
description: Detects use of net group from cmd.exe
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image: cmd.exe
    CommandLine|contains: "net group"
  condition: selection
