title: Suspicious Net User Command
description: Detects use of net user from cmd.exe
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image: cmd.exe
    CommandLine|contains: "net user"
  condition: selection
