[
  {
    "url": "https://www.microsoft.com/en-us/security/blog/2026/01/06/phishing-actors-exploit-complex-routing-and-misconfigurations-to-spoof-domains/",
    "expected_items": [
      "EmailEvents | where Timestamp >= ago(30d) | where EmailDirection == \"Inbound\" | where Connectors == \"\" // No connector used | where SenderFromDomain in (\"contoso.com\") // Replace with your domain(s) | project Timestamp, NetworkMessageId, InternetMessageId, SenderMailFromAddress, SenderFromAddress, SenderDisplayName, SenderFromDomain, SenderIPv4, RecipientEmailAddress, Subject, DeliveryAction, DeliveryLocation",
      "EmailEvents | where EmailDirection == \"Inbound\" | where Connectors == \"\" // No connector used | where SenderFromDomain in (\"contoso.com\", \"fabrikam.com\") // Replace with your accepted domains | where AuthenticationDetails !contains \"SPF=pass\" // SPF failed or missing | where AuthenticationDetails !contains \"DKIM=pass\" // DKIM failed or missing | where AuthenticationDetails !contains \"DMARC=pass\" // DMARC failed or missing | where SenderIPv4 !in (\" \") // Exclude known relay IPs | where ThreatTypes has_any (\"Phish\", \"Spam\") or ConfidenceLevel == \"High\" // | project Timestamp, NetworkMessageId, InternetMessageId, SenderMailFromAddress, SenderFromAddress, SenderDisplayName, SenderFromDomain, SenderIPv4, RecipientEmailAddress, Subject, AuthenticationDetails, DeliveryAction",
      "//IP list and domain list- _Im_NetworkSession let lookback = 30d; let ioc_ip_addr = dynamic([\"162.19.196.13\", \"163.5.221.110\", \"51.195.94.194\", \"51.89.59.188\"]); let ioc_domains = dynamic([\"2fa.valoufroo.in.net\", \"valoufroo.in.net\", \"integralsm.cl\", \"absoluteprintgroup.com\"]); _Im_NetworkSession(starttime=todatetime(ago(lookback)), endtime=now()) | where DstIpAddr in (ioc_ip_addr) or DstDomain has_any (ioc_domains) | summarize imNWS_mintime=min(TimeGenerated), imNWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, DstDomain, Dvc, EventProduct, EventVendor",
      "//IP list - _Im_WebSession let lookback = 30d; let ioc_ip_addr = dynamic([\"162.19.196.13\", \"163.5.221.110\", \"51.195.94.194\", \"51.89.59.188\"]); _Im_WebSession(starttime=todatetime(ago(lookback)), endtime=now()) | where DstIpAddr in (ioc_ip_addr) | summarize imWS_mintime=min(TimeGenerated), imWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, Url, Dvc, EventProduct, EventVendor",
      "// file hash list - imFileEvent // Domain list - _Im_WebSession let ioc_domains = dynamic([\"2fa.valoufroo.in.net\", \"valoufroo.in.net\", \"integralsm.cl\", \"absoluteprintgroup.com\"]); _Im_WebSession (url_has_any = ioc_domains)",
      "// Add the list of domains to search for. let DomainList = dynamic([\"2fa.valoufroo.in.net\", \"valoufroo.in.net\", \"integralsm.cl\", \"absoluteprintgroup.com\"]); EmailEvents | where TimeGenerated > ago (1d) and DetectionMethods has \"spoof\" and SenderFromDomain in~ (DomainList) | project TimeGenerated, AR=parse_json(AuthenticationDetails) , NetworkMessageId, EmailDirection, Subject, SenderFromAddress, SenderIPv4, ThreatTypes, DetectionMethods, ThreatNames | evaluate bag_unpack(AR) | where column_ifexists('SPF','') =~ \"fail\" or column_ifexists('DMARC','') =~ \"fail\" or column_ifexists('DKIM','') =~ \"fail\" or column_ifexists('CompAuth','') =~ \"fail\" | extend Name = tostring(split(SenderFromAddress, '@', 0)[0]), UPNSuffix = tostring(split(SenderFromAddress, '@', 1)[0]) | extend Account_0_Name = Name | extend Account_0_UPNSuffix = UPNSuffix | extend IP_0_Address = SenderIPv4"
    ]
  },
  {
    "url": "https://www.crowdstrike.com/en-us/blog/crowdstrike-detects-blocks-sharepoint-zero-day-exploitation/",
    "expected_items": [
      "#Vendor=\"microsoft\" #event.module=\"iis\" #event.dataset=\"iis.access\" #repo!=\"xdr*\" | parseUrl(http.request.referrer) | http.request.method=\"POST\" url.path=\"/_layouts/15/ToolPane.aspx\" url.query=\"DisplayMode=Edit&a=/ToolPane.aspx\" http.request.referrer.path=\"/_layouts/SignOut.aspx\" | http.response.status_code =~ in(values=[200,302,401])",
      "correlate( cmd: { #event_simpleName=ProcessRollup2 event_platform=Win FileName=\"cmd.exe\" ParentBaseFileName=\"w3wp.exe\" } include: [aid, ComputerName, TargetProcessId, ParentBaseFileName, FileName, CommandLine], pwsh: { #event_simpleName=ProcessRollup2 event_platform=Win FileName=\"powershell.exe\" | aid <=> cmd.aid | ParentProcessId <=> cmd.TargetProcessId } include: [aid, ComputerName, TargetProcessId, ParentBaseFileName, FileName, CommandLine], aspx: { #event_simpleName=/^(NewScriptWritten|WebScriptFileWritten)$/ event_platform=Win FileName=/\\.aspx/i | aid <=> cmd.aid | ContextProcessId <=> pwsh.TargetProcessId } include: [aid, ComputerName, TargetFileName], sequence=true, within=5m)"
    ]
  },
  {
    "url": "https://www.microsoft.com/en-us/security/blog/2025/08/21/think-before-you-clickfix-analyzing-the-clickfix-social-engineering-technique/",
    "expected_items": [
      "DeviceRegistryEvents | where ActionType =~ \"RegistryValueSet\" | where InitiatingProcessFileName =~ \"explorer.exe\" | where RegistryKey has @\"\\CurrentVersion\\Explorer\\RunMRU\" | where RegistryValueData has \"✅\" or (RegistryValueData has_any (\"powershell\", \"mshta\", \"curl\", \"msiexec\", \"^\") and RegistryValueData matches regex \"[Ѐ-ӿͰ-Ͽ֐-׿؀-ۿ฀-๿Ⲁ-⳿Ꭰ-᏿԰-֏Ⴀ-ჿऀ-ॿ]\") or (RegistryValueData has \"mshta\" and RegistryValueName !~ \"MRUList\" and RegistryValueData !in~ (\"mshta.exe\\\\1\", \"mshta\\\\1\")) or (RegistryValueData has_any (\"bitsadmin\", \"forfiles\", \"ProxyCommand=\") and RegistryValueName !~ \"MRUList\") or ((RegistryValueData startswith \"cmd\" or RegistryValueData startswith \"powershell\") and (RegistryValueData has_any (\"-W Hidden \", \" -eC \", \"curl\", \"E:jscript\", \"ssh\", \"Invoke-Expression\", \"UtcNow\", \"Floor\", \"DownloadString\", \"DownloadFile\", \"FromBase64String\", \"System.IO.Compression\", \"System.IO.MemoryStream\", \"iex\", \"Invoke-WebRequest\", \"iwr\", \"Get-ADDomainController\", \"InstallProduct\", \"-w h\", \"-X POST\", \"Invoke-RestMethod\", \"-NoP -W\", \".InVOKe\", \"-useb\", \"irm \", \"^\", \"[char]\", \"[scriptblock]\", \"-UserAgent\", \"UseBasicParsing\", \".Content\") or RegistryValueData matches regex @\"[-/–][Ee^]{1,2}[NnCcOoDdEeMmAa^]*\\s[A-Za-z0-9+/=]{15,}\"))",
      "DeviceProcessEvents | where InitiatingProcessFileName == \"powershell.exe\" | where InitiatingProcessParentFileName == \"explorer.exe\" | where FileName has_any (\"WScript.exe\") | where ProcessCommandLine contains \"\\\"PowerShell.exe\\\" -windowstyle minimized -Command\" and ProcessCommandLine has \"Invoke-WebRequest\"",
      "//IP list and domain list- _Im_NetworkSession let lookback = 30d; let ioc_ip_addr = dynamic([\"185.234.72.186\", \"45.94.31.176\", \"3.138.123.13\", \"16.171.23.221\", \"3.23.103.13\", \"83.242.96.159\", \"5.8.9.77\"]); let ioc_domains = dynamic([\"mein-lonos-cloude.de\", \"derko-meru.online\", \"objectstorage.ap-singapore-2.oraclecloud.com\", \"tesra.shop\", \"zzzp.live\", \"cqsf.live\", \"access-ssa-gov.es\", \"binancepizza.info\", \"panel-spectrum.net\"]); _Im_NetworkSession(starttime=todatetime(ago(lookback)), endtime=now()) | where DstIpAddr in (ioc_ip_addr) or DstDomain has_any (ioc_domains) | summarize imNWS_mintime=min(TimeGenerated), imNWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, DstDomain, Dvc, EventProduct, EventVendor",
      "//IP list - _Im_WebSession let lookback = 30d; let ioc_ip_addr = dynamic([\"185.234.72.186\", \"45.94.31.176\", \"3.138.123.13\", \"16.171.23.221\", \"3.23.103.13\", \"83.242.96.159\", \"5.8.9.77\"]); let ioc_sha_hashes =dynamic([\"061d378ffed42913d537da177de5321c67178e27e26fca9337e472384d2798c8\", \"592ef7705b9b91e37653f9d376b5492b08b2e033888ed54a0fd08ab043114718\", \"8fb329ae6b590c545c242f0bef98191965f7afed42352a0c84ca3ccc63f68629\", \"d9ffe7d433d715a2bf9a31168656e965b893535ab2e2d9cab81d99f0ce0d10c9\", \"f77c924244765351609777434e0e51603e7b84c5a13eef7d5ec730823fc5ebab\"]); _Im_WebSession(starttime=todatetime(ago(lookback)), endtime=now()) | where DstIpAddr in (ioc_ip_addr) or FileSHA256 in (ioc_sha_hashes) | summarize imWS_mintime=min(TimeGenerated), imWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, Url, Dvc, EventProduct, EventVendor",
      "// Domain list - _Im_WebSession let ioc_domains = dynamic([\"mein-lonos-cloude.de\", \"derko-meru.online\", \"objectstorage.ap-singapore-2.oraclecloud.com\", \"tesra.shop\", \"zzzp.live\", \"cqsf.live\", \"access-ssa-gov.es\", \"binancepizza.info\", \"panel-spectrum.net\"]); _Im_WebSession (url_has_any = ioc_domains)",
      "// file hash list - imFileEvent let ioc_sha_hashes = dynamic([\"061d378ffed42913d537da177de5321c67178e27e26fca9337e472384d2798c8\", \"592ef7705b9b91e37653f9d376b5492b08b2e033888ed54a0fd08ab043114718\", \"8fb329ae6b590c545c242f0bef98191965f7afed42352a0c84ca3ccc63f68629\", \"d9ffe7d433d715a2bf9a31168656e965b893535ab2e2d9cab81d99f0ce0d10c9\", \"f77c924244765351609777434e0e51603e7b84c5a13eef7d5ec730823fc5ebab\"]); imFileEvent | where SrcFileSHA256 in (ioc_sha_hashes) or TargetFileSHA256 in (ioc_sha_hashes) | extend AccountName = tostring(split(User, @'')[1]), AccountNTDomain = tostring(split(User, @'')[0]) | extend AlgorithmType = \"SHA256\""
    ]
  },
  {
    "url": "https://www.microsoft.com/en-us/security/blog/2025/12/09/shai-hulud-2-0-guidance-for-detecting-investigating-and-defending-against-the-supply-chain-attack/",
    "expected_items": [
      "DeviceProcessEvents | where FileName has \"node\" and ProcessCommandLine has_any (\"setup_bun.js\", \"bun_environment.js\")",
      "DeviceProcessEvents | where InitiatingProcessFileName in~ (\"node\", \"node.exe\") and InitiatingProcessCommandLine endswith \".js\" | where (FileName in~ (\"bun\", \"bun.exe\") and ProcessCommandLine has \".js\") or (FileName in~ (\"cmd.exe\") and ProcessCommandLine has_any (\"where bun\", \"irm \", \"[Environment]::GetEnvironmentVariable('PATH'\", \"|iex\")) or (ProcessCommandLine in~ (\"sh\", \"dash\", \"bash\") and ProcessCommandLine has_any (\"which bun\", \".bashrc && echo $PATH\", \"https://bun.sh/install\")) | where ProcessCommandLine !contains \"bun\" and ProcessCommandLine !contains \"\\\\\" and ProcessCommandLine !contains \"--\"",
      "DeviceProcessEvents | where FileName has_any (\"bash\",\"Runner.Listener\",\"cmd.exe\") | where ProcessCommandLine has 'SHA1HULUD' and not (ProcessCommandLine has_any('malicious','grep','egrep',\"checknpm\",\"sha1hulud-checker-ado\",\"sha1hulud-checker-ado\",\" sha1hulud-checker-github\",\"sha1hulud-checker\",\"sha1hulud-scanner\",\"go-detector\",\"SHA1HULUD_IMMEDIATE_ACTIONS.md\",\"SHA1HULUD_COMPREHENSIVE_REPORT.md\",\"reddit.com\",\"sha1hulud-scan.sh\"))",
      "CloudProcessEvents | where (ProcessCommandLine has \"--name SHA1HULUD\" ) or (ParentProcessName == \"node\" and (ProcessName == \"bash\" or ProcessName == \"dash\" or ProcessName == \"sh\") and ProcessCommandLine has \"curl -fsSL https://bun.sh/install | bash\") | project Timestamp, AzureResourceId, KubernetesPodName, KubernetesNamespace, ContainerName, ContainerId, ContainerImageName, ProcessName, ProcessCommandLine, ProcessCurrentWorkingDirectory, ParentProcessName, ProcessId, ParentProcessId, AccountName",
      "CloudProcessEvents | where (ParentProcessName == \"bun\" and ProcessName in (\"bash\",\"dash\",\"sh\") and ProcessCommandLine has_any(\"az account get-access-token\",\"azd auth token\")) or (ParentProcessName == \"bun\" and ProcessName == \"tar\" and ProcessCommandLine has_any (\"trufflehog\",\"truffler-cache\")) | project Timestamp, AzureResourceId, KubernetesPodName, KubernetesNamespace, ContainerName, ContainerId, ContainerImageName, ProcessName, ProcessCommandLine, ProcessCurrentWorkingDirectory, ParentProcessName, ProcessId, ParentProcessId, AccountName"
    ]
  },
  {
    "url": "https://www.crowdstrike.com/en-us/blog/falcon-prevents-cookie-spider-shamos-delivery-macos/",
    "expected_items": [
      "event_platform=Mac #event_simpleName=ScriptControlScanInfo ScriptContent=\"*dscl*curl*xattr*chmod*\" | format(\"[GraphExplorer](https://falcon.crowdstrike.com/graphs/process-explorer/tree?id=pid:%s:%s)\", field=[\"aid\", \"TargetProcessId\"], as=GraphExplorer) | groupBy([aid, GraphExplorer, ScriptContent])",
      "event_platform=Mac #event_simpleName=ProcessRollup2 ImageFileName=\"*/tmp/*\" | join({event_platform=Mac #event_simpleName=ProcessRollup2 ImageFileName=\"*osascript\" CommandLine=\"*-e*\" | rename(field=\"CommandLine\", as=\"ChildCommandLine\") | rename(field=\"ImageFileName\", as=\"ChildImageFileName\")}, field=TargetProcessId, key=ParentProcessId, include=[\"ChildImageFileName\", \"ChildCommandLine\"], limit=20000) | format(\"[GraphExplorer](https://falcon.crowdstrike.com/graphs/process-explorer/tree?id=pid:%s:%s)\", field=[\"aid\", \"TargetProcessId\"], as=GraphExplorer) | groupBy([aid, GraphExplorer, ImageFileName, CommandLine, ChildImageFileName, ChildCommandLine])",
      "event_platform=Mac #event_simpleName=ProcessRollup2 FileName=curl CommandLine=\"*POST*out.zip*\" | format(\"[GraphExplorer](https://falcon.crowdstrike.com/graphs/process-explorer/tree?id=pid:%s:%s)\", field=[\"aid\", \"TargetProcessId\"], as=GraphExplorer) | groupBy([aid, GraphExplorer, ImageFileName, CommandLine])"
    ]
  },
  {
    "url": "https://www.microsoft.com/en-us/security/blog/2025/12/15/defending-against-the-cve-2025-55182-react2shell-vulnerability-in-react-server-components/",
    "expected_items": [
      "CloudAuditEvents | where (ProcessCommandLine == \"/bin/sh -c (whoami)\" and (ParentProcessName == \"node\" or ParentProcessName has \"next-server\")) or (ProcessCommandLine has_any (\"echo\",\"powershell\") and ProcessCommandLine matches regex @'(echo\\s+\\$\\(\\(\\d+\\*\\d+\\)\\)|powershell\\s+-c\\s+\"\\d+\\*\\d+\")') | project Timestamp, KubernetesPodName, KubernetesNamespace, ContainerName, ContainerId, ContainerImageName, FileName, ProcessName, ProcessCommandLine, ProcessCurrentWorkingDirectory, ParentProcessName, ProcessId, ParentProcessId, AccountName",
      "let lookback = 10d; DeviceProcessEvents | where Timestamp >= ago(lookback) | where InitiatingProcessParentFileName has \"node\" | where InitiatingProcessCommandLine has_any (\"next start\", \"next-server\") or ProcessCommandLine has_any (\"next start\", \"next-server\") | summarize make_set(InitiatingProcessCommandLine), make_set(ProcessCommandLine) by DeviceId, Timestamp //looking for powershell activity | where set_ProcessCommandLine has_any (\"cmd.exe\",\"powershell\") | extend decoded_powershell_1 = replace_string(tostring(base64_decode_tostring(tostring(split(tostring(split(set_ProcessCommandLine.[0],\"EncodedCommand \",1).[0]),'\"',0).[0]))),\"\\0\",\"\") | extend decoded_powershell_1b = replace_string(tostring(base64_decode_tostring(tostring(split(tostring(split(set_ProcessCommandLine.[0],\"Enc \",1).[0]),'\"',0).[0]))),\"\\0\",\"\") | extend decoded_powershell_2 = replace_string(tostring(base64_decode_tostring(tostring(split(tostring(split(set_ProcessCommandLine.[0],\"enc \",1).[0]),'\"',0).[0]))),\"\\0\",\"\") | extend decoded_powershell_3 = replace_string(tostring(base64_decode_tostring(tostring(split(tostring(split(set_ProcessCommandLine.[0],\"ec \",1).[0]),'\"',0).[0]))),\"\\0\",\"\") | where set_ProcessCommandLine !has \"'powershell -c \" | extend decoded_powershell = iff( isnotempty( decoded_powershell_1),decoded_powershell_1, iff(isnotempty( decoded_powershell_2), decoded_powershell_2, iff(isnotempty( decoded_powershell_3), decoded_powershell_3,decoded_powershell_1b))) | project-away decoded_powershell_1, decoded_powershell_1b, decoded_powershell_2,decoded_powershell_3 | where isnotempty( decoded_powershell)",
      "let lookback = 10d; DeviceProcessEvents | where Timestamp >= ago(lookback) | where InitiatingProcessFileName =~ \"node.exe\" and InitiatingProcessCommandLine has \".js\" | where FileName =~ \"cmd.exe\" | where (ProcessCommandLine has_any (@\"\\next\\\", @\"\\npm\\npm\\node_modules\\\", \"\\\\server.js\") and (ProcessCommandLine has_any (\"powershell -c \\\"\", \"curl\", \"wget\", \"echo $\", \"ipconfig\", \"start msiexec\", \"whoami\", \"systeminfo\", \"$env:USERPROFILE\", \"net user\", \"net group\", \"localgroup administrators\", \"-ssh\", \"set-MpPreference\", \"add-MpPreference\", \"rundll32\", \"certutil\", \"regsvr32\", \"bitsadmin\", \"mshta\", \"msbuild\") or (ProcessCommandLine has \"powershell\" and (ProcessCommandLine has_any (\"Invoke-Expression\", \"DownloadString\", \"DownloadFile\", \"FromBase64String\", \"Start-Process\", \"System.IO.Compression\", \"System.IO.MemoryStream\", \"iex \", \"iex(\", \"Invoke-WebRequest\", \"iwr \", \".UploadFile\", \"System.Net.WebClient\") or ProcessCommandLine matches regex @\"[-/–][Ee^]{1,2}[NnCcOoDdEeMmAa^]*\\s[A-Za-z0-9+/=]{15,}\")))) or ProcessCommandLine matches regex @'cmd\\.exe\\s+/d\\s+/s\\s+/c\\s+\"powershell\\s+-c\\s+\"[0-9]+\\*[0-9]+\"\"'",
      "let lookback = 10d; DeviceProcessEvents | where Timestamp >= ago(lookback) | where InitiatingProcessFileName == \"node\" | where InitiatingProcessCommandLine has_any (\" server.js\", \" start\", \"/server.js\") | where ProcessCommandLine has_any (\"| sh\", \"openssl,\", \"/dev/tcp/\", \"| bash\", \"|sh\", \"|bash\", \"bash,\", \"{sh,}\", \"SOCK_STREAM\", \"bash -i\", \"whoami\", \"| base64 -d\", \"chmod +x /tmp\", \"chmod 777\") | where ProcessCommandLine !contains \"vscode\" and ProcessCommandLine !contains \"/.claude/\" and ProcessCommandLine !contains \"/claude\"",
      "//IP list and domain list- _Im_NetworkSession let lookback = 30d; let ioc_ip_addr = dynamic([\"194.69.203.32\", \"162.215.170.26\", \"216.158.232.43\", \"196.251.100.191\", \"46.36.37.85\", \"92.246.87.48\"]); let ioc_domains = dynamic([\"anywherehost.site\", \"xpertclient.net\", \"superminecraft.net.br\", \"overcome-pmc-conferencing-books.trycloudflare.com\", \"donaldjtrmp.anondns.net\", \"labubu.anondns.net\", \"krebsec.anondns.net\", \"hybird-accesskey-staging-saas.s3.dualstack.ap-northeast-1.amazonaws.com\", \"ghostbin.axel.org\", \"194.69.203.32:81\", \"194.69.203.32:81\", \"194.69.203.32:81\", \"162.215.170.26:3000\", \"216.158.232.43:12000\", \"overcome-pmc-conferencing-books.trycloudflare.com\", \"donaldjtrmp.anondns.net:1488\", \"labubu.anondns.net:1488\", \"krebsec.anondns.net:2316/dong\", \"hybird-accesskey-staging-saas.s3.dualstack.ap-northeast-1.amazonaws.com\", \"ghostbin.axel.org\"]);n_Im_NetworkSession(starttime=todatetime(ago(lookback)), endtime=now())n| where DstIpAddr in (ioc_ip_addr) or DstDomain has_any (ioc_domains) | summarize imNWS_mintime=min(TimeGenerated), imNWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, DstDomain, Dvc, EventProduct, EventVendor",
      "//IP list - _Im_WebSession let lookback = 30d; let ioc_ip_addr = dynamic([\"194.69.203.32\", \"162.215.170.26\", \"216.158.232.43\", \"196.251.100.191\", \"46.36.37.85\", \"92.246.87.48\"]); let ioc_sha_hashes =dynamic([\"c2867570f3bbb71102373a94c7153239599478af84b9c81f2a0368de36f14a7c\", \"9e9514533a347d7c6bc830369c7528e07af5c93e0bf7c1cd86df717c849a1331\", \"b63860cefa128a4aa5d476f300ac45fd5d3c56b2746f7e72a0d27909046e5e0f\", \"d60461b721c0ef7cfe5899f76672e4970d629bb51bb904a053987e0a0c48ee0f\", \"d3c897e571426804c65daae3ed939eab4126c3aa3fa8531de5e8f0b66629fe8a\", \"d71779df5e4126c389e7702f975049bd17cb597ebcf03c6b110b59630d8f3b4d\", \"b5acbcaccc0cfa54500f2bbb0745d4b5c50d903636f120fc870082335954bec8\", \"4cbdd019cfa474f20f4274310a1477e03e34af7c62d15096fe0df0d3d5668a4d\", \"f347eb0a59df167acddb245f022a518a6d15e37614af0bbc2adf317e10c4068b\", \"661d3721adaa35a30728739defddbc72b841c3d06aca0abd4d5e0aad73947fb1\", \"876923709213333099b8c728dde9f5d86acfd0f3702a963bae6a9dde35ba8e13\", \"2ebed29e70f57da0c4f36a9401a7bbd36e6ddd257e0920aa4083240afa3a6457\", \"f1ee866f6f03ff815009ff8fd7b70b902bc59b037ac54b6cae9b8e07beb854f7\", \"7e90c174829bd4e01e86779d596710ad161dbc0e02a219d6227f244bf271d2e5\"]);b_Im_WebSession(starttime=todatetime(ago(lookback)), endtime=now())b| where DstIpAddr in (ioc_ip_addr) or FileSHA256 in (ioc_sha_hashes) | summarize imWS_mintime=min(TimeGenerated), imWS_maxtime=max(TimeGenerated), EventCount=count() by SrcIpAddr, DstIpAddr, Url, Dvc, EventProduct, EventVendor",
      "// Domain list - _Im_WebSession let ioc_domains = dynamic([\"anywherehost.site\", \"xpertclient.net\", \"superminecraft.net.br\", \"overcome-pmc-conferencing-books.trycloudflare.com\", \"donaldjtrmp.anondns.net\", \"labubu.anondns.net\", \"krebsec.anondns.net\", \"hybird-accesskey-staging-saas.s3.dualstack.ap-northeast-1.amazonaws.com\", \"ghostbin.axel.org\", \"194.69.203.32:81\", \"194.69.203.32:81\", \"194.69.203.32:81\", \"162.215.170.26:3000\", \"216.158.232.43:12000\", \"overcome-pmc-conferencing-books.trycloudflare.com\", \"donaldjtrmp.anondns.net:1488\", \"labubu.anondns.net:1488\", \"krebsec.anondns.net:2316/dong\", \"hybird-accesskey-staging-saas.s3.dualstack.ap-northeast-1.amazonaws.com\", \"ghostbin.axel.org\"]); _Im_WebSession (url_has_any = ioc_domains)",
      "// file hash list - imFileEvent let ioc_sha_hashes = dynamic([\"c2867570f3bbb71102373a94c7153239599478af84b9c81f2a0368de36f14a7c\", \"9e9514533a347d7c6bc830369c7528e07af5c93e0bf7c1cd86df717c849a1331\", \"b63860cefa128a4aa5d476f300ac45fd5d3c56b2746f7e72a0d27909046e5e0f\", \"d60461b721c0ef7cfe5899f76672e4970d629bb51bb904a053987e0a0c48ee0f\", \"d3c897e571426804c65daae3ed939eab4126c3aa3fa8531de5e8f0b66629fe8a\", \"d71779df5e4126c389e7702f975049bd17cb597ebcf03c6b110b59630d8f3b4d\", \"b5acbcaccc0cfa54500f2bbb0745d4b5c50d903636f120fc870082335954bec8\", \"4cbdd019cfa474f20f4274310a1477e03e34af7c62d15096fe0df0d3d5668a4d\", \"f347eb0a59df167acddb245f022a518a6d15e37614af0bbc2adf317e10c4068b\", \"661d3721adaa35a30728739defddbc72b841c3d06aca0abd4d5e0aad73947fb1\", \"876923709213333099b8c728dde9f5d86acfd0f3702a963bae6a9dde35ba8e13\", \"2ebed29e70f57da0c4f36a9401a7bbd36e6ddd257e0920aa4083240afa3a6457\", \"f1ee866f6f03ff815009ff8fd7b70b902bc59b037ac54b6cae9b8e07beb854f7\", \"7e90c174829bd4e01e86779d596710ad161dbc0e02a219d6227f244bf271d2e5\"]);dimFileEventd| where SrcFileSHA256 in (ioc_sha_hashes) or TargetFileSHA256 in (ioc_sha_hashes) | extend AccountName = tostring(split(User, @'')[1]), AccountNTDomain = tostring(split(User, @'')[0]) | extend AlgorithmType = \"SHA256\""
    ]
  },
  {
    "url": "https://securelist.com/macos-security-and-typical-attacks/117367/",
    "expected_items": [
      "title: Keychain access description: This rule detects dumping of keychain tags: - attack.credential-access - attack.t1555.001 logsource: category: process_creation product: macos detection: selection: cmdline: security cmdline: -list-keychains -dump-keychain condition: selection falsepositives: - Unknow level: medium",
      "title: SIP status discovery description: This rule detects SIP status discovery tags: - attack.discovery - attack.t1518.001 logsource: category: process_creation product: macos detection: selection: cmdline: csrutil status condition: selection falsepositives: - Unknow level: low",
      "title: Quarantine attribute removal description: This rule detects removal of the Quarantine attribute, that leads to avoid File Quarantine tags: - attack.defense-evasion - attack.t1553.001 logsource: category: process_creation product: macos detection: selection: cmdline: xattr -d com.apple.quarantine condition: selection falsepositives: - Unknow level: high",
      "title: Gatekeeper disable description: This rule detects disabling of Gatekeeper tags: - attack.defense-evasion - attack.t1562.001 logsource: category: process_creation product: macos detection: selection: cmdline: spctl cmdline: - '--master-disable' - '--global-disable' condition: selection"
    ]
  },
  {
    "url": "https://www.cisa.gov/news-events/analysis-reports/ar25-338a",
    "expected_items": []
  },
  {
    "url": "https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/",
    "expected_items": [
      "title: Scheduled task executing powershell encoded payload from registry status: Experimental description: Detects the creation of a schtask that executes a base64 encoded payload stored in the Windows Registry using PowerShell. author: @Kostastsale , @TheDFIRReport references: - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/ date: 2022/02/12 logsource: product: windows category: process_creation detection: selection1: Image|endswith: '\\schtasks.exe' CommandLine|contains|all: - '/Create' - '/SC' selection2: CommandLine|contains|all: - 'FromBase64String' - 'powershell' - 'Get-ItemProperty' - 'HKCU:' condition: selection1 and selection2 falsepositives: - Uknown level: high tags: - attack.execution - attack.persistence - attack.t1053.005 - attack.t1059.001",
      "title: Execution of ZeroLogon PoC executable status: Experimental description: Detects the execution of the commonly used ZeroLogon PoC executable. author: @Kostastsale, @TheDFIRReport references: - https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/ - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/ date: 2022/02/12 logsource: product: windows category: process_creation detection: selection1: ParentImage|endswith: - '\\cmd.exe' Image|endswith: - '\\cool.exe' - '\\zero.exe' CommandLine|contains|all: - 'Administrator' - '-c' selection2: CommandLine|contains|all: - 'taskkill' - '/f' - '/im' selection3: CommandLine|contains: - 'powershell' condition: selection1 and (selection2 or selection3) falsepositives: - Uknown level: high tags: - attack.execution - attack.lateral_movement - attack.T1210",
      "title: Enabling RDP service via reg.exe command execution status: Experimental description: Detects the execution of reg.exe and subsequent command line arguments for enabling RDP service on the host author: @Kostastsale , @TheDFIRReport references: - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/ date: 2022/02/12 logsource: product: windows category: process_creation detection: selection1: Image|endswith: - '\\reg.exe' CommandLine|contains|all: - 'add' - 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server' - 'REG_DWORD' Winstations1: CommandLine|contains: - 'WinStations\\RDP-Tcp' Winstations2: CommandLine|contains: - 'MaxInstanceCount' - 'fEnableWinStation' selection2: CommandLine|contains|all: - 'Licensing Core' - 'EnableConcurrentSessions' selection3: CommandLine|contains: - 'TSUserEnabled' - 'TSEnabled' - 'TSAppCompat' - 'IdleWinStationPoolCount' - 'TSAdvertise' - 'AllowTSConnections' - 'fSingleSessionPerUser' condition: selection1 and ((Winstations1 and Winstations2) or (selection2 or selection3)) falsepositives: - Uknown level: high tags: - attack.defense_evasion - attack.lateral_movement - attack.t1021.001 - attack.t1112"
    ]
  },
  {
    "url": "https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/",
    "expected_items": [
      "title: Potential Qbot SMB DLL Lateral Movement id: 3eaa2cee-2dfb-46e9-98f6-3782aab30f38 status: Experimental description: Detection of potential us of SMB to transfer DLL's into the C$ folder of hosts unique to Qbot malware for purposes of lateral movement. author: \\@TheDFIRReport date: 2022/09/12 references: - https://thedfirreport.com/ logsource: product: zeek service: smb_files detection: selection_1: zeek_smb_files_path|endswith: - 'C$' selection_2: file_name|endswith: - '\\.dll.cfg' condition: selection_1 and selection_2 falsepositives: - RMM Tools and Administrative activities in C$ Share. level: medium tags: - attack.lateral_movement - attack.t1570"
    ]
  }
]
